{
  "blogs": [
    {
      "id": 1,
      "title": "A learning Experience at our farm",
      "date": "2026-02-04",
      "excerpt": "Nairobi Urban Green welcomed visitors to learn farm operations and see crops like arrow roots up close.",
      "content": "Today was a vibrant and memorable day at NUG Farm as we welcomed a group of local visitors who were eager to learn more about how our planting farm operates. From the moment they arrived, there was a warm sense of curiosity as they explored the different sections of the farm and observed the variety of crops we nurture.\nThe guests spent time learning about the planting process, soil preparation, crop rotation, and the daily care that keeps the farm running smoothly. A good part of the tour focused on our arrow roots which are among our most valued crops. The visitors were surprised by how much care and patience is required for healthy arrow roots to grow. They learned about the ideal soil moisture, the spacing needed for proper development, and the harvesting process. Many of them said they had eaten arrow roots their whole lives but had never seen how they grow from start to finish.\nApart from arrow roots they also learned about several other crops we grow at the farm. They enjoyed seeing the different stages of growth and asking many questions about farm management and the best practices we follow. The interaction was lively and full of new insights.\nOne of the most exciting moments came when the visitors were allowed to pick a few fresh items to take home. They selected different vegetables and produce straight from the garden and looked forward to cooking them later in the day. Carrying those fresh items brought genuine smiles and a strong sense of appreciation for the farm to table experience.\nThe visit reminded us of the value of sharing knowledge with the community. It creates understanding, strengthens local relationships, and shows people how food truly grows. We look forward to welcoming more visitors in the future and continuing to share the NUG Farm experience with everyone.",
      "image": "blog-images/blog-1.jpg",
      "images": ["blog-images/blog-1a.jpg"]
    },
    {
      "id": 2,
      "title": "Why Every Urban Garden Should Be Beautiful and Smartly Planned",
      "date": "2026-02-04",
      "excerpt": "A well designed urban garden can be functional and beautiful, attracting pollinators, visitors, and community interest.",
      "content": "An urban garden should not only be functional but also beautiful. A well-designed garden filled with herbs, flowers, and shrubs does more than just provide food. It attracts visitors, pollinators, birds, and even photography lovers looking for the perfect background.\nCreating a beautiful garden starts with thoughtful planning. Once the layout is arranged with a mix of sustainable plants, the next important step is choosing crops that can thrive in different conditions. Some vegetables and shrubs grow well even during dry seasons.\nAt Nairobi Urban Green, we’ve always encouraged planting with both purpose and beauty in mind. In the photo, you can see a mix of soybeans, nightshade, climbing beans, and bush soldier — a hardy shrub with bright yellow flowers that adds life and color to the garden.\nThese plants not only brighten the space but also offer reliable yields for urban farmers. By combining visual appeal with practical value, urban gardens become places for nourishment, education, relaxation, and community connection.\nA garden can be many things. With the right approach, it becomes a space to grow food, share knowledge, and bring people together.",
      "image": "blog-images/blog-2.jpg",
      "images": ["blog-images/blog-2a.jpg"]
    },
    {
      "id": 3,
      "title": "Why Urban Gardens Are the Future of Growing Cities",
      "date": "2026-02-04",
      "excerpt": "As cities grow, small space gardens improve nutrition, learning, and sustainability in crowded areas.",
      "content": "Just like in the United States, Kenya is experiencing a rapid rise in urban populations. More and more people are moving to towns and cities, and with that shift comes real challenges, especially when it comes to access to food, clean air, and green spaces.\nTrees have always been essential to human life. They provide shade, fruits, medicine, firewood, and help purify the air we breathe. In crowded urban environments where space is limited, urban gardens are becoming a practical and necessary solution.\nVegetables and herb gardens are also playing an increasingly important role. They support better nutrition, help improve diets, and serve as learning tools for students and researchers. Agriculture students, in particular, benefit from growing and observing these crops firsthand.\nIn the photo below, you can see beans and herbs being grown in plastic containers in Nairobi. It’s a simple but powerful example of how schools and communities are adapting to limited space. Without access to land, many schools are now embracing smart, sustainable farming methods.\nFrom sack gardens to recycled containers, more institutions are finding creative ways to grow food in urban areas. These efforts are not only feeding people but also educating and inspiring the next generation to live more sustainably.\nAt Nairobi Urban Green, we are proud to support these efforts and continue working with communities to create greener, healthier cities through urban agriculture.",
      "image": "blog-images/blog-3.jpg",
      "images": ["blog-images/blog-3a.jpg"]
    },
    {
      "id": 4,
      "title": "🌾 Cassava: A Resilient Crop for Urban Farmers",
      "date": "2026-02-04",
      "excerpt": "Cassava is hardy and reliable, and Nairobi Urban Green is distributing free cuttings to support families and resilience.",
      "content": "Cassava, a root crop believed to have originated from South America and domesticated over 10,000 years ago, has become one of the most reliable food sources across the world. It was introduced to Africa by the Portuguese between the 16th and 17th century and has since become a staple food in many communities, including here in Kenya.\nWhat makes cassava unique is its resilience. It grows well in poor soils, requires little attention, and can survive harsh weather conditions. This makes it an ideal crop for urban farmers in Nairobi, especially those working with limited space, resources, or time.\nDespite its ease of cultivation, cassava has become increasingly expensive in local markets. This rise in cost makes it harder for low-income households to access what was once considered an affordable, everyday food.\nAt Nairobi Urban Green, we believe everyone should have access to nutritious, traditional crops like cassava. That’s why we are currently distributing free cassava cuttings to urban farmers across Nairobi and surrounding areas. The goal is to help families grow their own food, save on expenses, and build resilience through self-reliant farming.\nWhether planted in sacks, small plots, or community gardens, cassava can thrive and provide food security in urban settings. Through initiatives like this, we hope to promote sustainable agriculture, revive traditional foods, and empower more people to take part in greening their own cities.",
      "image": "blog-images/blog-4.jpg"
    },
    {
      "id": 5,
      "title": "🌱 Empowering Urban Farmers Through Community Seed Production",
      "date": "2026-02-04",
      "excerpt": "Community seed production boosts self reliance through composting, seed saving, and shared planting materials.",
      "content": "In many African countries, including Kenya, urban farming has become an important way for families to grow their own food. But one area that is often overlooked is the right for urban farmers to produce their own seeds.\nMost current laws only allow licensed companies to produce seeds. This makes it harder for small farmers to save and share seeds within their communities. At Nairobi Urban Green, we believe that needs to change. Urban farmers should be allowed to produce seeds for their own use through community seed production, as long as they are not selling them.\nThat’s why we are introducing urban farmers to simple ways of producing seeds using domestic leftovers. By turning kitchen waste and organic scraps into compost, we help farmers grow healthy crops while also saving seeds for future planting.\nIn the photo above, Fresh tomatoes, soybeans, and sukuma were all grown using this method. These crops not only provided food but also gave us strong, healthy seeds that we shared with local schools and farmers.\nCommunity seed production helps people become more self-reliant. It supports food security, protects traditional crops, and allows people to farm in a way that works for them. We hope that with more awareness and support, more urban farmers will be able to grow food and save seeds in their own spaces.\nAt Nairobi Urban Green, this is part of what we do every day. Helping people grow their own food and take care of the environment, one garden at a time.",
      "image": "blog-images/blog-5.jpg",
      "images": ["blog-images/blog-a.jpg"]
    },
    {
      "id": 6,
      "title": "🌱 When Soil Meets Diplomacy: Nairobi Urban Green at the Heart of a Global Dialogue",
      "date": "2014-01-01",
      "excerpt": "A landmark 2014 moment where grassroots innovation met global diplomacy during a major exhibition opening in Nairobi.",
      "content": "On a landmark evening at the French Culture Center in 2014, the spirit of grassroots innovation met global diplomacy during the official opening of the UN International Year of Family Farming exhibition. At the center of it all stood Francis Ilahaka, Founder and CEO of Nairobi Urban Green, sharing his practical insights on urban agriculture with some of the highest-ranking French representatives in attendance.\nCaptured in a powerful moment, Ilahaka is seen explaining Nairobi Urban Green’s community-based seed production model to the French Culture Center Director (right) and a top French diplomat (left). The display before them — made of local plants grown from household waste, traditional containers, and nutrient-rich soil — became more than just an exhibit. It was a story of resilience, sustainability, and possibility.\nIlahaka’s simple, hands-on approach to growing food in cities through the reuse of domestic waste struck a chord with the audience. With clarity and passion, he emphasized how these models not only feed families but also empower them — turning urban homes, schools, and streets into sources of nourishment and pride.\nThe exhibition, part of a global celebration recognizing the role of family farmers in ending hunger and promoting sustainability, provided the perfect stage for Nairobi Urban Green to showcase its mission. The presence of foreign dignitaries and cultural leaders alongside grassroots innovators reinforced the shared understanding that solutions to today’s challenges are most powerful when they are both local and inclusive.\nThis exchange was more than a photo opportunity. It was a symbol of how grassroots movements, when given a platform, can shape global dialogue — and how people from different walks of life can come together over one shared truth: that food, dignity, and the future of the planet begin right where we stand — with soil, seed, and community.",
      "image": "blog-images/blog-6.jpg"
    },
    {
      "id": 7,
      "title": "🌱 Greening Schools, Growing Hope:",
      "date": "2016-01-13",
      "excerpt": "A tree planting partnership at Shadrack Primary School that inspired climate action and community ownership.",
      "content": "On a sunny day in Nairobi, a powerful partnership came to life as Lions Club International teamed up with Nairobi Urban Green (NUG) to bring sustainable change to Shadrack Primary School. This tree-planting initiative wasn’t just about adding greenery — it was about sowing seeds of awareness, climate action, and community ownership.\nStudents, teachers, and volunteers gathered with great enthusiasm, shovels in hand, to take part in the symbolic act of planting trees within the school compound. For many of the students, it was their first hands-on experience with environmental conservation — one that left a lasting impression. With every seedling placed into the earth, there was a lesson planted too: that sustainability starts with each of us, and small actions today grow into greater change tomorrow.\nThe collaboration between Lions Club International and Nairobi Urban Green was built on a shared belief — that schools are not just centers of academic learning, but also powerful spaces for nurturing environmental responsibility. By improving the school’s green cover, we not only aimed to enhance the physical environment but also to create an outdoor classroom that would foster curiosity, learning, and care for nature.\nBeyond beautification, the initiative aligned with Nairobi Urban Green’s larger mission to promote environmental education and sustainable urban farming. It was a demonstration of what can be achieved when organizations come together in service of the community. The smiles on the children’s faces and the genuine engagement from volunteers said it all — this was more than a CSR activity; it was an investment in the future.\nCaptured in a photograph that day is the essence of the work we do: hands deep in the soil, guided by a shared vision, and rooted in a commitment to grow greener, healthier spaces for learning and living.",
      "image": "blog-images/blog-7.jpg",
      "images": ["blog-images/blog-7a.jpg"]
    },
    {
      "id": 8,
      "title": "🌍 From Grassroots to Global: Nairobi Urban Green Joins Family Farming Exhibition",
      "date": "2014-01-01",
      "excerpt": "Nairobi Urban Green joined the International Year of Family Farming exhibition and shared its model with global partners.",
      "content": "In 2014, Nairobi Urban Green proudly took part in the International Year of Family Farming exhibition hosted at the French Culture Center in Nairobi — an event that celebrated the role of family farmers in ensuring food security and sustainable development. Among the many highlights of the day was a moment of shared passion and purpose between Francis Ilahaka, the Founder and CEO of Nairobi Urban Green, and one of the world’s top maize scientists, captured in a powerful exchange of knowledge and vision.\nHeld under the global banner set by the United Nations, the exhibition aimed to recognize the vital contributions of small-scale farmers and promote inclusive agricultural practices that respect both people and the planet. Francis Ilahaka, already known for his grassroots efforts in turning domestic waste into food-growing opportunities, stood proudly among innovators and scientists, sharing ideas, tools, and seedlings that embody Nairobi Urban Green’s simple yet effective approach to urban agriculture.\nThe meeting between Ilahaka and the renowned maize researcher symbolized more than just a photo-op — it marked the bridging of grassroots experience with high-level agricultural research. Standing side by side, both men held publications and seedlings, signaling a shared belief: that solutions to hunger and environmental decline lie not only in advanced science but also in empowering communities with knowledge, seeds, and sustainable practices.\nFor Nairobi Urban Green, being part of this international event was not just an honor — it was a reaffirmation of our mission. It showed that our model of community seed production, school gardens, and food-from-waste farming is not just local, but globally relevant. Events like these inspire our continued work, proving that real change begins with people who care deeply about both the soil beneath them and the future ahead.\nCaptured in this photograph is more than a moment, it’s a meeting of minds and missions united by the belief that family farming is a foundation for a healthier, greener world.",
      "image": "blog-images/blog-8.jpg"
    }
  ]
}
